<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use App\Models\Genres;
class GenresSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
       $GenresData = [
        [
            'genres_id' => 1,
            'genres_name' =>'ตลก,คอมเมดี้(Comedy)',
'description' => 'ภาพยนตร์ตลก เบาสมอง เหมาะกับคนที่ต้องการดูเพื่อการพักผ่อน ไม่ต้องคิดอะไรมาก',
        ],
        [
            'genres_id' => 2,
            'genres_name' =>'สยองขวัญ(Horror)',
'description' => 'เป็นภาพยนตร์ที่มุ่งเน้นทำให้ผู้ชมรู้สึกหวาดกลัว, เสียวไส้ และรู้สึกสยองขวัญ',
        ],
        [
            'genres_id' => 3,
            'genres_name' =>'แอคชั่น(Action)',
'description' => 'ภาพยนตร์แบบบู๊ แอ็กชั่น ยิง ต่อสู้ ระทึกใจ เหมาะสำหรับคนชอบความแข็งแรงและศิลปะการต่อสู้ ในภาพยนตร์แนวนี้จะมีฉากยิง ระเบิด เผาสิ่งต่างๆ ที่เราอาจจะหาดูได้ยาก',
        ],
        [
            'genres_id' => 4,
            'genres_name' =>'ดราม่า,ชีวิต(Drama)',
'description' => 'เป็นประเภทของเรื่องเล่าบันเทิงคดี (หรือกึ่งบันเทิงคดี) ที่มีความเอาจริงเอาจังกว่าความตลกขบขันเชิงโทน',
        ],
        [
            'genres_id' => 5,
            'genres_name' =>'วิทยาศาสตร์(Sci-Fi)',
'description' => 'ภาพยนตร์ที่มีเนื้อหาอ้างอิงวิทยาศาสตร์ แต่ทำออกมาให้น่าสนใจอาจจะผสมจินตนาการเข้าไปด้วย',
        ],
        [
            'genres_id' => 6,
            'genres_name' =>'อาชญากรรม(Crime)',
'description' => 'เป็นประเภทหนึ่งของภาพยนตร์ที่มีเนื้อหาเกี่ยวกับการสืบสวนคดีอาชญา เรื่องราวบางเรื่องอาจมีสืบสวนของตำรวจหรือนักสืบสอบสวนฆาตกรรม บางเรื่องมีลักษณะของการแก้ไขปริศนาหรือคดีอาชญาที่ซ่อนเร้น',
        ],
        [
            'genres_id' => 7,
            'genres_name' =>'อนิเมชั่น(Animation)',
'description' => 'สร้างขึ้นจากการวาดภาพสติก (Frame) ต่อสติกเพื่อสร้างภาพเคลื่อนไหว โดยมักใช้เทคนิคการ์ตูน (Cartoon) หรือเทคโนโลยีการสร้างภาพเคลื่อนไหวอื่น ๆ',
        ],
        [
            'genres_id' => 8,
            'genres_name' =>'ผจญภัย(Adventure)',
'description' => 'เป็นแนวหนังหรือนิยายที่เน้นการต่อสู้ การสำรวจ และการผจญภัยของตัวละครหลักในสถานการณ์และสถานที่ที่ไม่คุ้นเคย',
        ],
        [
            'genres_id' => 9,
            'genres_name' =>'ครอบครัว(Family)',
'description' => 'เป็นแนวที่เน้นความสนุกสนานและการเรียนรู้ที่เหมาะสำหรับทุกวัยในครอบครัว มักจะมีเรื่องราวที่เกี่ยวกับความรัก ความสำคัญของครอบครัว และการแก้ไขปัญหาภายในครอบครัว',
        ],
        [
            'genres_id' => 10,
            'genres_name' =>'ระทึกขวัญ(Thriller)',
'description' => 'แนวหนังที่มีบทสร้างสรรค์และน่าตื่นเต้น มักมีบทสปันของการต่อสู้ ความลับ หรือความตาย ส่วนใหญ่มักจะมีบรรยากาศที่ดำมืด ระทึกขวัญ และท้าทายความคิด',
        ],
    ];

    foreach ($GenresData as $data) {
        Genres::create($data);
    }
}
}
